In [160]:
# Import Libraries
import pandas as pd
import numpy as np
import os

#cityTemp_path = '/Users/ryumugil/Downloads'
#cols_list = ['Region', 'Country', 'State', 'City', 'Month', 'Day', 'Year', 'AvgTemperature']
#df_cityTemp = pd.read_csv(os.path.join(cityTemp_path, 'city_temperature.csv'))

Finding Missing values

In [162]:
df_cityTemp.isnull().sum()

Region            0
Country           0
State             0
City              0
Month             0
Day               0
Year              0
AvgTemperature    0
dtype: int64

In [163]:
df_cityTemp.head()

,Region,Country,State,City,Month,Day,Year,AvgTemperature
1450990,North America,US,Alabama,Birmingham,1,1,1995,50.7
1450991,North America,US,Alabama,Birmingham,1,2,1995,37.2
1450992,North America,US,Alabama,Birmingham,1,3,1995,33.2
1450993,North America,US,Alabama,Birmingham,1,4,1995,33.3
1450994,North America,US,Alabama,Birmingham,1,5,1995,26.4

Finding Missing values

In [165]:
df_nan = df_cityTemp[df_cityTemp['City'].isnull()== True]

df_nan

Empty DataFrame
Columns: [Region, Country, State, City, Month, Day, Year, AvgTemperature]
Index: []

Addressing missing values

In [167]:
df_cityTemp.shape

(1455337, 8)

Another way to drop Missing values

In [169]:
df_cityTemp.dropna(inplace = True)

In [170]:
cols_list = ['Region', 'Country', 'State', 'Month', 'Day', 'Year', 'AvgTemperature']
df_cityTemp_clean = pd.read_csv(os.path.join(cityTemp_path, 'city_temperature_cleaned.csv'))
df_cityTemp_clean.head()

/var/folders/qx/qj_9c1q9595cg344qrssq5qr0000gq/T/ipykernel_33892/2140945170.py:2: DtypeWarning: Columns (2) have mixed types. Specify dtype option on import or set low_memory=False.
  df_cityTemp_clean = pd.read_csv(os.path.join(cityTemp_path, 'city_temperature_cleaned.csv'))

   Region  Country State     City  Month  Day  Year  AvgTemperature
0  Africa  Algeria   NaN  Algiers      1    1  1995            64.2
1  Africa  Algeria   NaN  Algiers      1    2  1995            49.4
2  Africa  Algeria   NaN  Algiers      1    3  1995            48.8
3  Africa  Algeria   NaN  Algiers      1    4  1995            46.4
4  Africa  Algeria   NaN  Algiers      1    5  1995            47.9

Finding Duplicates

In [172]:
df_dups = df_cityTemp_clean[df_cityTemp_clean.duplicated()]

df_dups

,Region,Country,State,City,Month,Day,Year,AvgTemperature
742977,Europe,Germany,NaN,Hamburg,12,9,2007,-99.0
742983,Europe,Germany,NaN,Hamburg,12,15,2007,-99.0
742984,Europe,Germany,NaN,Hamburg,12,16,2007,-99.0
742990,Europe,Germany,NaN,Hamburg,12,22,2007,-99.0
742991,Europe,Germany,NaN,Hamburg,12,23,2007,-99.0
...,...,...,...,...,...,...,...,...
1705580,North America,US,Maryland,Washington DC,5,9,2020,45.2
1705581,North America,US,Maryland,Washington DC,5,10,2020,50.2
1705582,North America,US,Maryland,Washington DC,5,11,2020,56.1
1705583,North America,US,Maryland,Washington DC,5,12,2020,52.5
1705584,North America,US,Maryland,Washington DC,5,13,2020,53.4

Addressing Duplicates

In [174]:
df_cityTemp_clean.shape

(2906327, 8)

In [175]:
df_cityTemp_clean_no_dups = df_cityTemp_clean.drop_duplicates()
df_cityTemp_clean_no_dups.shape

(2885612, 8)